test_cases/naca-Ma-0.83_Re-1.5_alpha-5_fine/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          293;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           $inletValue;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           $inletValue;
    }

    airfoil
    {
        type            zeroGradient;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    processor
    {
    	type  processor;
    	value $internalField;
    }
}

// ************************************************************************* //
